app/controllers/investors_controller.rb

INSERT INTO "investors" ("full_name", "address", "zip_code", "town", "country", "fiscal_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @investor = Investor.new(investor_params)

    respond_to do |format|
      if @investor.save

SELECT  "investors".* FROM "investors" WHERE "investors"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_investor
      @investor = Investor.find(params[:id])